NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM21/MGM210PB22JIA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG_NS</name>
      <version>0</version>
      <description>SYSCFG_NS Registers</description>
      <baseAddress>0x5007C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSCFG</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SW0</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>SW1</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>SW2</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>SW3</name>
        <value>56</value>
      </interrupt>
      <registers>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3303000F</resetMask>
          <fields>
            <field>
              <name>SW0</name>
              <description>Software Interrupt 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW1</name>
              <description>Software Interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW2</name>
              <description>Software Interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW3</name>
              <description>Software Interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERR1B</name>
              <description>RAM 1-bit ECC Error Interrupt flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERR2B</name>
              <description>RAM 2-bit ECC Error Interrupt flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMERR1B</name>
              <description>SEQRAM 1-bit ECC Error Interrupt flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMERR2B</name>
              <description>SEQRAM 2-bit ECC Error Interrupt flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMERR1BIF</name>
              <description>FRCRAM 1-bit ECC Error Interrupt flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMERR2BIF</name>
              <description>FRCRAM 2-bit ECC Error Interrupt flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3303000F</resetMask>
          <fields>
            <field>
              <name>SW0</name>
              <description>Software interrupt 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW1</name>
              <description>Software interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW2</name>
              <description>Software interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW3</name>
              <description>Software interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERR1B</name>
              <description>RAM 1-bit ECC Error Interrupt enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERR2B</name>
              <description>RAM 2-bit ECC Error Interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMERR1B</name>
              <description>SEQRAM 1-bit ECC Error Interrupt enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMERR2B</name>
              <description>SEQRAM 2-bit ECC Error Interrupt enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMERR1BIEN</name>
              <description>FRCRAM 1-bit ECC Error Interrupt enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMERR2BIEN</name>
              <description>FRCRAM 2-bit ECC Error Interrupt enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREVHW</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF0FFFFF</resetMask>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>Chip Rev Major value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAMILY</name>
              <description>Chip Family value  </description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Chip Rev Minor value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREV</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>Part Revision Major value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAMILY</name>
              <description>Part Family value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Part Revision Minor value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGSYSTIC</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>SYSTICEXTCLKEN</name>
              <description>SysTick External Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000021</resetValue>
          <resetMask>0x00000021</resetMask>
          <fields>
            <field>
              <name>ADDRFAULTEN</name>
              <description>Invalid Address Bus Fault Response Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMECCERRFAULTEN</name>
              <description>Two bit ECC Error Bus Fault Response Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0RETNCTRL</name>
          <description>No Description</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>RAMRETNCTRL</name>
              <description>DMEM0 blockset retention control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLON</name>
                  <description>None of the RAM blocks powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK5</name>
                  <description>Power down RAM block 5  (address range 0x20014000-0x20017FFF)</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK4TO5</name>
                  <description>Power down RAM blocks 4 and above (address range 0x20010000-0x20017FFF)</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK3TO5</name>
                  <description>Power down RAM blocks 3 and above (address range 0x2000C000-0x20017FFF)</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK2TO5</name>
                  <description>Power down RAM blocks 2 and above (address range 0x20008000-0x20017FFF)</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK1TO5</name>
                  <description>Power down RAM blocks 1 and above (address range 0x20004000-0x20017FFF)</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0ECCADDR</name>
          <description>No Description</description>
          <addressOffset>0x210</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMEM0ECCADDR</name>
              <description>DMEM0 RAM ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0ECCCTRL</name>
          <description>No Description</description>
          <addressOffset>0x214</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RAMECCEWEN</name>
              <description>RAM ECC Write Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMECCCHKEN</name>
              <description>RAM ECC Check Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0RAMCTRL</name>
          <description>No Description</description>
          <addressOffset>0x218</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>RAMCACHEEN</name>
              <description>RAM CACHE Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMWSEN</name>
              <description>RAM WAIT STATE Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMPREFETCHEN</name>
              <description>RAM Prfetch Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIORAMRETNCTRL</name>
          <description>No Description</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000101</resetMask>
          <fields>
            <field>
              <name>SEQRAMRETNCTRL</name>
              <description>SEQRAM Memory Shutdown Control Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLON</name>
                  <description>SEQRAM not powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQBLK</name>
                  <description>Power down SEQRAM (address range 0x50000000-0x50001FFF)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCRAMRETNCTRL</name>
              <description>FRCRAM Memory Shutdown Control Register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLON</name>
                  <description>FRCRAM not powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRCBLK</name>
                  <description>Power down FRCRAM (address range 0x50002000-0x50002FFF)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIOECCCTRL</name>
          <description>No Description</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000303</resetMask>
          <fields>
            <field>
              <name>SEQRAMECCEWEN</name>
              <description>SEQRAM ECC Write Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMECCCHKEN</name>
              <description>SEQRAM ECC Check Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMECCEWEN</name>
              <description>FRCRAM ECC Write Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMECCCHKEN</name>
              <description>FRCRAM ECC Check Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIORAMCTRL</name>
          <description>No Description</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01070007</resetMask>
          <fields>
            <field>
              <name>SEQRAMCACHEEN</name>
              <description>SEQRAM CACHE Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMWSEN</name>
              <description>SEQRAM WAIT STATE Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMPREFETCHEN</name>
              <description>SEQRAM Prfetch Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMCACHEEN</name>
              <description>FRCRAM CACHE Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMWSEN</name>
              <description>FRCRAM WAIT STATE Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMPREFETCHEN</name>
              <description>FRCRAM Prfetch Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMODRAMCACHEEN</name>
              <description>DEMODRAM CACHE Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQRAMECCADDR</name>
          <description>No Description</description>
          <addressOffset>0x410</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQRAMECCADDR</name>
              <description>SEQRAM ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRCRAMECCADDR</name>
          <description>No Description</description>
          <addressOffset>0x414</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRCRAMECCADDR</name>
              <description>FRCRAM ECC Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
